app/Http/Controllers/AdminController.php

    public function create()
    {
        return view('admin.adminAkun.createAdminAkun', [
            'perusahaans' => perusahaan::all()
        ]);
---
select * from "perusahaans"