app/Http/Controllers/BannerController.php

    public function index()
    {
        return view('admin.banner.homeBanner', [
            'banners' => banner::all()
        ]);
---
select * from "banners"

    public function create()
    {
        return view("admin.banner.createBanner", [
            'perusahaans' => perusahaan::all()
        ]);
---
select * from "perusahaans"