app/Http/Controllers/BeritaController.php

    public function create()
    {
        return view('admin.berita.createBerita', [
            'perusahaans' => perusahaan::all()
        ]);
---
select * from `beritas`
select * from "perusahaans"