app/Http/Controllers/companyProfile.php

    public function index()
    {
        // return view('company-profile.homepage');

        $tanggal_hari_ini = date('y-m-d');

        // Ambil data visitor hari ini
        $visitors = visitor::where('tanggal', $tanggal_hari_ini)->first();

        if (!$visitors) {
            // Jika belum ada, buat baru
            $visitors = new visitor();
            $visitors->tanggal = $tanggal_hari_ini;
            $visitors->jumlah_visit = 1;
            $visitors->save();
        } else {
            // Jika sudah ada, tambah jumlah visit
            $visitors->jumlah_visit += 1;
            $visitors->save();
        }

        $id_perusahaan = 'induk_ARP Global Media_2102220087754'; // atau bisa dari session, auth, atau parameter

        // session(['id_perusahaan' => $id_perusahaan]);
        $perusahaan = Perusahaan::with([
            'banner',
            'layanan',
            'partner',
            'berita',
            'portofolio',
            'faq',
            'kbli'
        ])->where('id_perusahaan', $id_perusahaan)->first();
---
select * from `banners` where `banners`.`id_perusahaan` in ('induk_ARP Global Media_2102220087754')
select * from `beritas` where `beritas`.`id_perusahaan` in ('induk_ARP Global Media_2102220087754')
select * from `faqs` where `faqs`.`id_perusahaan` in ('induk_ARP Global Media_2102220087754')
select * from `kblis` where `kblis`.`id_perusahaan` in (1)

    public function show($nama_perusahaan)
    {
        // return view('company-profile.homepage');

        // $nama_perusahan = 'induk_ARP Global Media_2102220087754'; // atau bisa dari session, auth, atau parameter
        $perusahaan = Perusahaan::with([
            'banner',
            'layanan',
            'partner',
            'berita',
            'portofolio',
            'faq',
            'kbli'
        ])->where('nama_perusahaan', $nama_perusahaan)->first();
---
select * from `perusahaans` where `nama_perusahaan` = '1750078479_fd418cd679e7d2d363ad15700429d1ce.png' limit 1

    public function layanan($nama_perusahaan)
    {
        if (!$nama_perusahaan) {
            abort(404, 'Perusahaan belum dipilih.');
        }

        $perusahaan = Perusahaan::with('layanan')
            ->where('nama_perusahaan', $nama_perusahaan)
            ->first();
---
select * from `perusahaans` where `nama_perusahaan` = 'ARP Global Media' limit 1

    public function portofolio($nama_perusahaan)
    {
        if (!$nama_perusahaan) {
            abort(404, 'Perusahaan belum dipilih.');
        }

        $perusahaan = Perusahaan::with('portofolio.portofolio_Foto') // relasi eager loading
            ->where('nama_perusahaan', $nama_perusahaan)
            ->first();
---
select * from `perusahaans` where `nama_perusahaan` = 'ARP Global Media' limit 1