app/Http/Controllers/KbliController.php

select * from `perusahaans`
---
    public function index()
    {
        $role = Auth::user()->role;
        if ($role === 'superAdmin') {
            $kblis = kbli::with('perusahaan')->get();