app/Http/Controllers/LayananController.php

    public function store(Request $request)
    {
        $id_layanan = $request->id_perusahaan . '_' . $request->nama_layanan ;
        $request->merge([
            'id_layanan' => $id_layanan,
            // 'password' => bcrypt($request->password) // hash password juga di sini
        ]);
        $data = $request->all();
        if ($request->hasFile('foto')) {
            $filename = time() . '_' . $request->file('foto')->getClientOriginalName();
            $destination = 'image/upload/foto';
            $request->file('foto')->move(public_path($destination), $filename);
            $data['foto'] = $destination . '/' . $filename;
        }
        layanan::create($data);
---
insert into "layanans" ("nama_layanan", "deskripsi", "id_perusahaan", "foto", "id_layanan", "updated_at", "created_at") values ('1', '1', 'anak_A_123', 'Sheila On 7 formasi awal.jpeg', 'anak_A_123_1', '2025-05-25 16:43:40', '2025-05-25 16:43:40')