app/Http/Controllers/LayananController.php

select exists(select * from `layanans` where `id_layanan` = 'induk_ARP Global Media_2102220087754_Event') as `exists`
---
    public function store(Request $request)
    {
        $role = Auth::user()->role;
        if ($role !== 'superAdmin') {
            $admin = Auth::user();
            $request->merge(['id_perusahaan' => $admin->id_perusahaan]);
        }
        $baseId = $request->id_perusahaan . '_' . str_replace(' ', '_', $request->nama_layanan);

        if (Layanan::where('id_layanan', $baseId)->exists()) {

insert into `layanans` (`nama_layanan`, `deskripsi`, `id_perusahaan`, `id_layanan`, `foto`, `updated_at`, `created_at`) values ('Event', 'Wujudkan event impian Anda dengan layanan perencanaan dan pelaksanaan event kami yang tanpa cela. Kami menangani setiap detail, mulai dari konsep awal, pemilihan lokasi, manajemen vendor, perizinan, hingga logistik di hari-H, baik untuk acara korporat, peluncuran produk, gathering, hingga festival. Tim berpengalaman kami bekerja keras untuk memastikan event Anda berjalan lancar, sesuai anggaran, dan meninggalkan kesan mendalam bagi para peserta. Fokuslah pada tujuan event Anda, kami yang akan mengurus sisanya.', 'induk_ARP Global Media_2102220087754', 'induk_ARP Global Media_2102220087754_Event', '1750176596_61bfc2a2932b0e0e4c09bd18d830e0ec.png', '2025-06-17 16:09:56', '2025-06-17 16:09:56')
---
            $request->file('foto')->move(public_path($destination), $filename);
            $data['foto'] = $filename;
        }
        layanan::create($data);