app/Http/Controllers/PerusahaanController.php

select * from `perusahaans`
---
    public function index()
    {
        $role = Auth::user()->role;

        if ($role === 'superAdmin') {
            $perusahaans = Perusahaan::all();

select * from `perusahaans` where `id` in ('6')
---
    public function update(Request $request, $id)
    {
        $perusahaan = Perusahaan::findOrFail($id);
        $role = Auth::user()->role;

        // Hanya izinkan admin dari perusahaan yang sesuai, kecuali superAdmin
        if ($role !== 'superAdmin') {
            $admin = Auth::user();
            if ($perusahaan->id_perusahaan !== $admin->id_perusahaan) {
                abort(403, 'Unauthorized');
            }
        }

        // Validasi kolom unique kecuali untuk data yang sedang diedit
        $uniqueFields = [
            'nib' => 'NIB',
            'npwp' => 'NPWP',
            'email' => 'Email'
        ];

        foreach ($uniqueFields as $field => $label) {
            $value = $request->$field;
            $exists = Perusahaan::where($field, $value)
                ->where('id', '!=', $id)
                ->exists();