app/Http/Controllers/PortofolioController.php

    public function edit(portofolio $portofolio)
    {
        return view('admin.portofolio.portofolio-edit', [
            'portofolio' => $portofolio,
            'perusahaans' => perusahaan::all()
        ]);
---
select * from "perusahaans"