app/Http/Controllers/PortofolioController.php

        }

        // Simpan portofolio
        $portofolio = portofolio::create($data);
---
insert into `portofolios` (`nama_project`, `deskripsi`, `status_project`, `tempat`, `tanggal`, `id_perusahaan`, `id_portofolio`, `waktu`, `updated_at`, `created_at`) values ('Pemasangan Iklan besar', 'kreatif untuk visual dan materi iklan, hingga penempatan iklan yang efektif di berbagai platform (digital dan konvensional). Tujuan kami adalah menciptakan kampanye yang tidak hanya menarik perhatian, tetapi juga menghasilkan engagement dan konversi yang signifikan. Biarkan kami membantu Anda menjangkau audiens yang tepat dan membangun brand awareness yang kuat.', 'done', 'Kota Bandung', '2025-12-11', 'induk_ARP Global Media_2102220087754', 'PRT_Pemasangan_Iklan_besar_1750186287', '11:11-11:11', '2025-06-17 18:51:28', '2025-06-17 18:51:28')

            if ($request->has('timeline')) {
                foreach ($request->timeline as $item) {
                    if (!empty($item['tanggal']) || !empty($item['deskripsi'])) {
                        timelinePortofolio::create([
                            'timeline_id' => 'tl-' . $request->nama_project . $item['tanggal'],
                            'id_portofolio' => $request->id_portofolio,
                            'tanggal' => $item['tanggal'],
                            'deskripsi' => $item['deskripsi'],
                        ]);
---
insert into `timeline_portofolios` (`timeline_id`, `id_portofolio`, `tanggal`, `deskripsi`, `updated_at`, `created_at`) values ('tl-Pemasangan Iklan besar2025-09-09', 'PRT_Pemasangan_Iklan_besar_1750186287', '2025-09-09', 'melihat', '2025-06-17 18:51:28', '2025-06-17 18:51:28')