app/Http/Controllers/PortofolioController.php

select * from `portofolios`
select * from `perusahaans`
---
    public function create()
    {

        return view('admin.portofolio.createPortofolio', [
            'perusahaans' => perusahaan::all()
        ]);