app/Http/Controllers/StrukturController.php

    public function index()
    {
        $role = Auth::user()->role;
        if ($role === 'superAdmin') {
            $strukturs = struktur::with('perusahaan')->get();
        } else {
            $strukturs = struktur::with('perusahaan')
                ->where('id_perusahaan', Auth::user()->id_perusahaan)
                ->get();
---
select * from `perusahaans` where `perusahaans`.`id_perusahaan` in ('anak_guitar men_1432', 'induk_ARP Global Media_2102220087754')